In [1]:
import pandas as pd
import numpy as np
from sklearn.metrics import accuracy_score,confusion_matrix
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree

In [2]:
frd_data=pd.read_csv('Fraud_check.csv')
frd_data

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [3]:
frd_data.shape

(600, 6)

In [4]:
frd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [5]:
frd_data.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [6]:
frd_data.isna().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [7]:
frd_data['status'] = frd_data['Taxable.Income'].apply(lambda Income: 'Risky' if Income <= 30000 else 'Good')

In [8]:
frd_data

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,status
0,NO,Single,68833,50047,10,YES,Good
1,YES,Divorced,33700,134075,18,YES,Good
2,NO,Married,36925,160205,30,YES,Good
3,YES,Single,50190,193264,15,YES,Good
4,NO,Married,81002,27533,28,NO,Good
...,...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES,Good
596,YES,Divorced,69967,55369,2,YES,Good
597,NO,Divorced,47334,154058,0,YES,Good
598,YES,Married,98592,180083,17,NO,Good
599,NO,Divorced,96519,158137,16,NO,Good

In [9]:
frd_data

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,status
0,NO,Single,68833,50047,10,YES,Good
1,YES,Divorced,33700,134075,18,YES,Good
2,NO,Married,36925,160205,30,YES,Good
3,YES,Single,50190,193264,15,YES,Good
4,NO,Married,81002,27533,28,NO,Good
...,...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES,Good
596,YES,Divorced,69967,55369,2,YES,Good
597,NO,Divorced,47334,154058,0,YES,Good
598,YES,Married,98592,180083,17,NO,Good
599,NO,Divorced,96519,158137,16,NO,Good

In [10]:
frd_data_1=frd_data.drop(columns=['Taxable.Income'])

In [11]:
frd_data_1['Marital.Status']

0        Single
1      Divorced
2       Married
3        Single
4       Married
         ...
595    Divorced
596    Divorced
597    Divorced
598     Married
599    Divorced
Name: Marital.Status, Length: 600, dtype: object

In [12]:
frd_data_1['Marital.Status']=frd_data_1['Marital.Status'].astype(str)

In [13]:
frd_data_1['Marital.Status']=np.where((frd_data_1['Marital.Status']=='Single'),0,
                                    (np.where(frd_data_1['Marital.Status']=='Married',1,2)))

In [14]:
frd_data_1

    Undergrad  Marital.Status  City.Population  Work.Experience Urban status
0          NO               0            50047               10   YES   Good
1         YES               2           134075               18   YES   Good
2          NO               1           160205               30   YES   Good
3         YES               0           193264               15   YES   Good
4          NO               1            27533               28    NO   Good
..        ...             ...              ...              ...   ...    ...
595       YES               2            39492                7   YES   Good
596       YES               2            55369                2   YES   Good
597        NO               2           154058                0   YES   Good
598       YES               1           180083               17    NO   Good
599        NO               2           158137               16    NO   Good

[600 rows x 6 columns]

In [15]:
frd_data_1['Undergrad']=np.where(frd_data_1['Undergrad']=='YES',1,0)
frd_data_1['Undergrad']

0      0
1      1
2      0
3      1
4      0
      ..
595    1
596    1
597    0
598    1
599    0
Name: Undergrad, Length: 600, dtype: int32

In [16]:
frd_data_1['Urban']=np.where(frd_data_1['Urban']=='YES',1,0)

In [17]:
frd_data_1['Urban']

0      1
1      1
2      1
3      1
4      0
      ..
595    1
596    1
597    1
598    0
599    0
Name: Urban, Length: 600, dtype: int32

In [18]:
frd_data_1['status']=np.where(frd_data['status']=='Good',1,0)
frd_data_1['status'].head(20)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    0
11    1
12    0
13    1
14    1
15    1
16    0
17    1
18    1
19    0
Name: status, dtype: int32

In [19]:
frd_data_1

,Undergrad,Marital.Status,City.Population,Work.Experience,Urban,status
0,0,0,50047,10,1,1
1,1,2,134075,18,1,1
2,0,1,160205,30,1,1
3,1,0,193264,15,1,1
4,0,1,27533,28,0,1
...,...,...,...,...,...,...
595,1,2,39492,7,1,1
596,1,2,55369,2,1,1
597,0,2,154058,0,1,1
598,1,1,180083,17,0,1
599,0,2,158137,16,0,1

In [20]:
x=frd_data_1.drop(['status'],axis=1)
y=frd_data_1['status']

In [21]:
x

     Undergrad  Marital.Status  City.Population  Work.Experience  Urban
0            0               0            50047               10      1
1            1               2           134075               18      1
2            0               1           160205               30      1
3            1               0           193264               15      1
4            0               1            27533               28      0
..         ...             ...              ...              ...    ...
595          1               2            39492                7      1
596          1               2            55369                2      1
597          0               2           154058                0      1
598          1               1           180083               17      0
599          0               2           158137               16      0

[600 rows x 5 columns]

In [22]:
y

0      1
1      1
2      1
3      1
4      1
      ..
595    1
596    1
597    1
598    1
599    1
Name: status, Length: 600, dtype: int32

In [23]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=40)

APPLAYING RANDOM FOREST......

In [24]:
from sklearn import metrics
from sklearn.ensemble import RandomForestClassifier
r_classifier = RandomForestClassifier(n_estimators = 10, criterion = 'gini',max_depth=3)
r_classifier.fit(x_train, y_train)

RandomForestClassifier(max_depth=3, n_estimators=10)

In [25]:
r_classifier.fit(x_train, y_train)

RandomForestClassifier(max_depth=3, n_estimators=10)

In [26]:
r_classifier.score(x_test, y_test)

0.7777777777777778

In [27]:
y_pred = r_classifier.predict(x_test)

In [28]:
y_pred

array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1])

In [31]:
confusion = metrics.confusion_matrix(y_test, y_pred)
confusion.ravel()

array([  0,  40,   0, 140], dtype=int64)

In [30]:
accuracy_score(y_test, y_pred)

0.7777777777777778

In [36]:
 precision_positive = metrics.precision_score(y_test, y_pred)
 
 precision_positive

0.7777777777777778

In [35]:
 recall_val = metrics.recall_score(y_test, y_pred)
 
 recall_val

1.0

In [34]:
f1_scr = metrics.f1_score(y_test, y_pred)

f1_scr

0.8750000000000001